{
    "role": "You are a medical expert at understanding and writing in the English language.",
    "goal": "Your goal is to check whether the given text is precise or not. If the text is not precise then respond with “No” with a feedback. If the text is precise then respond with “Yes” with no other text.",
    "definitions": [
        {
            "term": "Precise Text",
            "definition": "Precise text means using the exact words to describe something, leaving no room for confusion. In the medical field, this is crucial for accurate diagnoses and treatments. For example, instead of saying a patient has a \"stomach ache\", a doctor might use precise language to describe the pain as \"sharp, localized pain in the lower right quadrant of the abdomen,\" which could indicate appendicitis. This level of detail ensures everyone understands the problem and can take appropriate action."
        }
    ],
    "emphases": [
        "Always generate a \"Response\"",
        "Strictly follow the format of the examples.",
        "Use your best judgment to infer whether making the language precise causes complexity in comprehension. In that case, preciseness would lead to confusion in the reader’s mind and we do not want that."
    ],
    "feedback_instructions": [
        "Feedback should identify the problematic part of the text.",
        "Feedback should explain the reason for the part to be identified as problematic.",
        "Feedback should contain some action that could be performed to fix the problematic part of the text.",
        "Feedback should be concise, easy to follow and understandable.",
        "Feedback should not include any other information than the problematic part of the text and action that should be taken."
    ],
    "examples": [
        {
            "query": "What are the potential side effects of long-term corticosteroid use in patients with systemic lupus erythematosus (SLE)?",
            "text": "Long-term corticosteroid use can lead to various problems such as avascular necrosis, cataracts, and hypertension, including weight gain, bone thinning, and increased susceptibility to infections.",
            "cot": "Corticosteroids are immunosuppressive drugs, hence infections are an expected side effect. Weight gain and bone thinning are common side effects of corticosteroids. However, the term 'various problems' is vague and lacks specificity but problems are specified with it. Therefore text is precise.",
            "response": "Yes",
            "feedback": ""
        },
        {
            "query": "How does a positive tuberculin skin test (TST) differentiate between latent tuberculosis infection (LTBI) and active tuberculosis (TB) disease?",
            "text": "A positive TST indicates exposure to Mycobacterium tuberculosis, the bacteria that causes TB. Additional tests are needed to determine if the infection is active.",
            "cot": "While a positive TST indicates exposure to M. tuberculosis, it doesn't differentiate between LTBI and active TB disease. LTBI is a dormant infection, while active TB disease causes symptoms and is contagious. Further tests like chest X-rays, sputum cultures, and interferon-gamma release assays (IGRAs) are essential for confirming active TB disease. \"Additional tests\" is not precise as it does not give useful information.",
            "response": "No",
            "feedback": "Modify the text to clarify the need of \"Additional tests\" such as Chest X-rays, sputum cultures, or IGRAs."
        },
        {
            "query": "What are the different types of non-small cell lung cancer (NSCLC) and their treatment options?",
            "text": "NSCLC is the most common type of lung cancer. There are a few different types such as adenocarcinoma, squamous cell carcinoma, and large cell carcinoma, each with different treatment options like surgery, chemotherapy, and radiation therapy.",
            "cot": "The text correctly identifies NSCLC as the most common lung cancer but lacks specificity regarding the subtypes. \"few different types\" is not precise but types are listed in the text such as adenocarcinoma, squamous cell carcinoma, and large cell carcinoma. Treatment options vary depending on the stage, subtype, and overall health of the patient. Targeted therapies and immunotherapy may also be considered. The text is precise in language.",
            "response": "Yes",
            "feedback": ""
        },
        {
            "query": "Explain the pathophysiology of diabetic ketoacidosis (DKA) in type 1 diabetes mellitus (T1DM).",
            "text": "In T1DM, lack of insulin leads to high blood sugar. This causes the body to break down fat for energy, producing ketones. High ketone levels can be dangerous.",
            "cot": "The text provides a basic overview of DKA but lacks specific details about the pathophysiological mechanisms. In T1DM, insulin deficiency leads to hyperglycemia, which impairs glucose utilization. The body then resorts to lipolysis, producing ketones as an alternative energy source. Ketones are acidic, and their accumulation leads to metabolic acidosis, a key feature of DKA. \"can be dangerous\" is not precise and could mean several things. Osmotic diuresis, dehydration, and electrolyte imbalances are the dangers.",
            "response": "No",
            "feedback": "Expand the text \"can be dangerous\" to include detailed dangers of high ketone levels such as Osmotic diuresis, dehydration, and electrolyte imbalances."
        }
    ]
}